Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །བདུད་རྩི་མ་ཐོབ་སྟོན་པ་དོ་མོད་འཚང་རྒྱར་སྒྲོག །བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཀོད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་པའོ།། །།
en: “The Teacher is poised to awaken today, and subsequently to attain immortality!” This concludes the twentieth chapter, on the displays at the seat of awakening.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་མངོན་པར་བྱས་པར་གྱུར་ཏོ།
en: Monks, in order to venerate the Bodhisattva, the other bodhisattvas manifested many such displays at the seat of awakening.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱིས་ཀྱང་ཕྱོགས་བཅུ་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་བཀོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེར་ཀུན་ཏུ་བསྟན་ཏོ། །
en: The Bodhisattva himself, however, caused all the displays that ornamented all the seats of awakening of the past, present, and future buddhas in all the buddha realms in the ten directions to become visible right there at the seat of awakening.

source: དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། འདོད་པའི་ཁམས་འདིའི་བདག་པོ་དབང་ཕྱུག་དབང་སྒྱུར་བ་བདུད་སྡིག་ཅན་དེ་ལ་བདག་གིས་མ་སྦྲན་པར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་ནི་བདག་གི་མི་ཆས།
en: Monks, as the Bodhisattva now sat at the seat of awakening, he thought to himself, “Māra is the supreme lord who holds sway over the desire realm, the most powerful and evil demon. There is no way that I could attain unsurpassed and complete awakening without his knowledge.

source: བདག་གིས་བདུད་སྡིག་ཅན་བསྐུལ་བར་བྱའོ།
en: So I will now arouse that evil Māra.

source: །དེ་ལས་རྣམ་པར་རྒྱལ་ན་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་ལ་སོགས་པ་ཐམས་ཅད་ཚར་བཅད་པར་འགྱུར་རོ།
en: Once I have conquered him, all the gods in the desire realm will also be restrained.

source: །འོན་ཏང་བདུད་ཀྱི་འཁོར་ན་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་འཁོད་པ་དག་གིས་ངའི་སེང་གེ་རྣམ་པར་རོལ་པ་མཐོང་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་རོ་སྙམ་མོ།
en: Moreover, there are some gods in Māra’s retinue who have previously created some basic goodness. When they witness my lion-like display, they will direct their minds toward unsurpassed and complete awakening.”

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་བསམས་ནས་དེའི་ཚེ་སྨིན་མཚམས་ཀྱི་བར་གྱི་མཛོད་སྤུ་ནས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་འཇོམས་པར་བྱེད་པ་ཞེས་བྱ་བའི་འོད་ཟེར་གཅིག་ཕྱུང་སྟེ།
en: Monks, as soon as the Bodhisattva had this thought, a light known as the light which conquers all demonic congregations was emitted from the hair between his eyebrows.

source: འོད་ཟེར་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ཀྱི་བདུད་ཀྱི་གནས་ཐམས་ཅད་སྣང་བར་བྱས་ནས་མོག་མོག་པོར་བྱས་ཏེ་རབ་ཏུ་གཡོས་པར་བྱས་པར་ཡང་གྱུར་ཏོ།
en: The light illuminated all demonic abodes in the entire great trichiliocosm, making them dark by comparison and causing them to shake.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ཀྱང་སྣང་བ་ཆེན་པོས་ཡོངས་སུ་ཁྱབ་པར་གྱུར་ཏོ།
en: In fact the entire great trichiliocosm was bathed in an immense light.

source: །བདུད་སྡིག་ཅན་གྱིས་འོད་དེ་ལས་རྣམ་པ་འདི་ལྟ་བུའི་སྒྲ་འདི་ཡང་ཐོས་སོ།
en: From this light a voice called out to Māra, the evil one:

source: །སེམས་ཅན་ཤིན་ཏུ་དག་པ་བསྐལ་མང་སྤྱོད་སྤྱད་པ།
en: “Here is a pure being who has acted well for many eons.

source: །ཟས་གཙང་སྲས་པོས་རྒྱལ་སྲིད་དག་ནི་རབ་སྤངས་ཏེ།
en: As Śuddhodana’s son he abandoned his kingdom;

source: །ཕན་བྱེད་དེ་ནི་བདུད་རྩི་མངོན་པར་འདོད་པས་བྱུང་།
en: He appeared as a benefactor seeking immortality.

source: །བྱང་ཆུབ་ཤིང་དྲུང་འོངས་ཀྱིས་དེ་རིང་བསྒྲིམ་པར་གྱིས།
en: He has arrived at the Bodhi tree, so you should now make an effort!

source: །དེ་ནི་བདག་ཀྱང་རྒལ་ལ་གཞན་ཡང་སྒྲོལ་བར་བྱེད།
en: “Himself having crossed, he causes others to cross;

source: །དེ་ནི་བདག་ཉིད་གྲོལ་བས་གཞན་ཡང་གྲོལ་བར་བྱེད།
en: Himself liberated, he also liberates others.

source: །དེ་ནི་བདག་ཀྱང་དབུགས་ཕྱིན་གཞན་དག་དབུགས་ཀྱང་འབྱིན།
en: Having found relief, he gives relief to others;

source: །ཡོངས་སུ་མྱ་ངན་འདས་ནས་གཞན་དག་མྱ་ངན་ཟློ།
en: Having passed beyond suffering, he will cause others to transcend suffering.

source: །ངན་སོང་གསུམ་པོ་མ་ལུས་སྟོངས་པར་བྱེད་པར་འགྱུར།
en: “He will empty the three lower realms totally,

source: །ལྷ་མི་རྣམས་ཀྱི་གྲོང་ཁྱེར་གང་བར་བྱེད་པར་འགྱུར།
en: And fill the city of gods and humans.

source: །ཕན་པ་བྱེད་པ་དེ་ནི་བདུད་རྩི་ཐོབ་གྱུར་ནས།
en: He, the Benefactor, will attain immortality,

source: །བསམ་གཏན་མངོན་ཤེས་བདུད་རྩི་བདེ་མཆོག་སྦྱིན་པར་འགྱུར། །གང་ཚེ་རང་བྱུང་ཉིད་ཀྱིས་ཆོས་ཆར་མངོན་ཕབ་ཚེ།
en: And bestow absorptions, higher knowledge, immortality, and happiness.

source: །ནག་པོའི་རྩ་ལག་ཁྱོད་ཀྱི་གྲོང་ཁྱེར་སྟོངས་བྱེད་འགྱུར།
en: “He will empty your city, O evil kinsman;

source: །སྟོབས་མེད་པས་ཀྱང་སྟོབས་མེད་འགྱུར་ཏེ་དཔུང་ཉམས་འགྱུར།
en: With your army powerless, you will be without an army and without allies. When the Self-Arisen One, by his nature, pours down the rain of Dharma,

source: །ཕྱོགས་ནི་ཕྱོགས་མིན་ཅི་བྱ་གར་འགྲོ་ཤེས་མི་འགྱུར།
en: You will not know what to do or where to go.”

source: །དགེ་སློང་དག་དེ་ལྟར་བདུད་སྡིག་ཅན་བསྐུལ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བསྐུལ་ནས་རྨི་ལམ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་རྨིས་སོ། །རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་གི་གནས་མུན་པས་ཁྱབ་པར་རྨིས་པ་དང་། རང་གི་གནས་རྡུལ་གྱིས་གང་ཞིང་གྱོ་མོ་དང་གསེག་མས་གང་བར་རྨིས་པ་དང་། བདག་ཉིད་སྔངས་སྐྲག་ནས་ཕྱོགས་ཕྱོགས་སུ་འབྲོས་པར་རྨིས་པ་དང་། བདག་ཅོད་པན་དང་བྲལ་ཞིང་རྣ་ཆ་ལྷུང་བར་རྨིས་པ་དང་། བདག་མཆུ་དང་གྲེ་བ་དང་། རྐན་སྐམས་པར་རྨིས་པ་དང་། བདག་སྙིང་ཀུན་ཏུ་གདུངས་པར་རྨིས་པ་དང་། སྐྱེད་མོས་ཚལ་གྱི་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་རྣམས་རྙིས་པར་རྨིས་པ་དང་། རྫིང་རྣམས་སྐམས་ཏེ་ཆུ་མེད་པར་རྨིས་པ་དང་། ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དང་། ཀ་ལ་པིང་ཀ་དང་། ཀུ་ན་ལ་དང་། ཤང་ཤང་ཏེའུ་ལ་སོགས་པ་བྱའི་ཚོགས་རྣམས་འདབ་གཤོག་ཟེགས་པར་རྨིས་པ་དང་། རྔ་དང་། དུང་དང་། རྫ་རྔ་དང་། ཁར་རྔ་དང་། རྒྱུད་གཅིག་པ་དང་། པི་བང་དང་། རྒྱུད་གསུམ་པ་དང་། ཕེག་དང་། ཁར་བའི་སིལ་ཁྲོལ་ལ་སོགས་པ་རོལ་མོའི་ཆ་བྱད་རྣམས་ཆག་གྲུགས་ཏེ་ས་ལ་ལྷུང་བར་རྨིས་པ་དང་། འཁོར་སྡུག་པས་ཀྱང་བདུད་སྤངས་ཏེ་ངོ་འཛུམ་གནག་ཅིང་ཕྱོགས་གཅིག་ཏུ་དོང་ནས་སེམས་ཤིང་འཁོད་པར་རྨིས་པ་དང་། ཆུང་མའི་དམ་པ་ཕྲེང་བ་ཅན་ཡང་མལ་ནས་ས་ལ་ལྷུང་སྟེ་ལག་པ་གཉིས་མགོ་ལ་རྡེབ་པར་རྨིས་པ་དང་། བདུད་ཀྱི་བུ་གང་དག་ཤིན་ཏུ་བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། ཤིན་ཏུ་སྟོབས་དང་ལྡན་པ་དང་། ཤིན་ཏུ་གཟི་བརྗིད་དང་ལྡན་པ་དང་། ཤིན་ཏུ་ཤེས་རབ་དང་ལྡན་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པ་ལ་ཕྱག་འཚལ་བར་རྨིས་པ་དང་། བདག་གི་བུ་མོ་རྣམས་ཀྱང་ཀྱི་ཧུད་ཡབ། ཀྱི་ཧུད་ཡབ་ཅེས་ཆོ་ངེ་འདོན་པར་རྨིས་པ་དང་།
en: Monks, Māra, the evil one, was aroused by these verses and had a dream with thirty-two omens. What are these thirty-two? They are as follows: 1. He saw his abode being filled with darkness. 2. The abode was filled with dust, and rough with scattered pebbles. 3. Startled with fear and terror, he fled in the ten directions. 4. He lost his diadem and his earrings fell off. 5. His lips, throat, and mouth dried out. 6. His heart was beating fast. 7. The leaves, flowers, and fruits in his parks withered.8. His lotus ponds were emptied of water and dried out. 9. All birds, such as swans, cranes, peacocks, cuckoos, kunālas, the two-headed pheasants, and so forth, had broken wings. 10. All his musical instruments—such as his drum, conch, clay drum, hand drum, tambour, lute, harp, cymbals, and tambourines—broke, fell into pieces, then into shreds, and fell on the ground. 11. His beloved kinfolk and retinue abandoned him, their faces cast down, while he stood aside and brooded. 12. His chief queen, Māriṇī, fell from her bed onto the ground and started beating her head with her fists. 13. Those among his sons who were the most diligent, powerful, glorious, and intelligent prostrated to the Bodhisattva, who was sitting at the supremely sacred seat of awakening. 14. His daughters wailed and cried out, “Oh no, father, oh no, father!”

source: བདག་ལུས་ལ་གོས་དྲི་མ་ཅན་གྱོན་པར་རྨིས་པ་དང་། བདག་མགོ་རྡུལ་གྱིས་གང་ལ་སྐྱ་བོ་བསེང་བསེང་པོ་དང་། ཉམ་ཆུང་བ་དང་། མདངས་ཉམས་པར་རྨིས་པ་དང་། བསིལ་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། སྐར་ཁུང་དང་། རྟ་བབས་རྣམས་ཀྱང་རྡུལ་གྱིས་གང་ནས་རྡིབ་པར་རྨིས་པ་དང་། དེའི་སྡེ་དཔོན་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་དང་། དྲི་ཟའི་བདག་པོ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཨོམས་ཚུགས་བཅས་ཏེ་ངུ་ཞིང་ཆོ་ངེས་བཏབ་ནས་བྱེར་བར་རྨིས་པ་དང་།
en: 15. He was dressed in stained clothes. 16. With his head covered in dust and his face colorless and pale, he beheld himself as devoid of any vital force.17. His palace with its corridors, skylights, and porticoes became covered in dust and crumbled down. 18. All his generals from the realms of the yakṣas, rākṣasas, kumbhāṇḍas, and gandharvas placed their hands on their heads and fled while crying and wailing.

source: འདོད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ཀྱི་ལྷའི་བདག་པོ་འདི་ལྟ་སྟེ། ཡུལ་འཁོར་སྲུང་དང་། འཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། རྣམ་ཐོས་ཀྱི་བུ་དང་། བརྒྱ་བྱིན་དང་། རབ་འཐབ་བྲལ་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དང་། དབང་སྒྱུར་ལ་སོགས་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བདུད་ལ་མི་གུས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱོགས་པར་རྨིས་པ་དང་། ཐབ་མོའི་ནང་ན་དེའི་རལ་གྲི་ཤུགས་ནས་མ་ཕྱིན་ཅིང་བདག་མི་ཤིས་པའི་སྒྲ་འབྱིན་པར་རྨིས་པ་དང་། རང་གི་འཁོར་གྱིས་བདག་པོར་བར་རྨིས་པ་དང་། བཀྲ་ཤིས་ཀྱི་བུམ་པ་སྒོར་ལྷུང་བར་རྨིས་པ་དང་། བྲམ་ཟེ་མིས་བྱིན་གྱི་བུ་ཡང་བཀྲ་མི་ཤིས་པའི་སྒྲ་སྒྲོགས་པར་རྨིས་པ་དང་། སྒོ་བ་ཀུན་ཏུ་དགའ་བྱེད་ཀྱང་ཀུན་ཏུ་མི་དགའ་བའི་སྒྲ་སྒྲོགས་པར་རྨིས་པ་དང་། ནམ་མཁའི་དཀྱིལ་མུན་པས་ཁེབས་པར་རྨིས་པ་དང་། འདོད་པའི་གནས་ན་གནས་པའི་དཔལ་ཡང་ངུ་བར་རྨིས་པ་དང་། བདག་གི་དབང་ཡང་དབང་མེད་པར་གྱུར་པར་རྨིས་པ་དང་། རང་གི་ཕྱོགས་ཀྱང་ཕྱོགས་མ་ཡིན་པར་རྨིས་པ་དང་། ནོར་བུ་དང་མུ་ཏིག་གི་དྲ་བ་རྣམས་ཀྱང་ཆད་ཅིང་རྣམ་པར་ཆད་ནས་འབྲུལ་བར་རྨིས་པ་དང་། བདུད་ཀྱི་གནས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་གཡོས་པར་རྨིས་པ་དང་། ཤིང་རྣམས་ཀྱང་བཅད་ཅིང་བ་གམ་ཡང་ལྷུང་བར་རྨིས་པ་དང་།
en: 19. Whatever divine regents there are among the gods in the desire realm—Dhṛtarāṣṭra, Virūḍhaka, Virūpākṣa, Vaiśravaṇa, Śakra, Suyāma, Santuṣita, Sunirmāṇarati, Vaśavartin, and so forth—Māra, the evil one, saw all of them eagerly listening to the Bodhisattva with their faces turned toward him. 20. In the midst of battle, his sword could not be pulled from its sheath, and he himself was unwell and wailing. 21. His retinue abandoned him. 22. His vases full of auspicious items fell into a hole. 23. The priest Nārada pronounced a curse. 24. The gatekeeper Ānandita cried out in distress. 25. The canopy of the sky became covered in darkness. 26. The goddess Śrī, who lives in the desire realm, began to weep. 27. His faculties became ineffectual. 28. He lost his allies. 29. His lattices of jewels and pearls became silent, fell apart, tore, and fell down. 30. His whole dwelling swayed. 31. The trees and the turrets of his buildings tore and fell over.

source: བདུད་ཀྱི་སྡེ་བཀོད་པ་ཐམས་ཅད་ཀྱང་ཁས་སྦུབ་ཏུ་འགྱེལ་བར་རྨིས་པ་སྟེ། དགེ་སློང་དག་དེ་ལྟར་བདུད་སྡིག་ཅན་གྱི་རྨི་ལམ་དུ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་ལྟ་བུ་རྨིས་སོ།
en: 32. The entire army of Māra was felled in a confrontation. Monks, such were the thirty-two omens in the dream of Māra, the evil one.

source: །དེ་སད་པ་དང་། འཇིགས་སྐྲག་སྔངས་ནས་ནང་མི་ཐམས་ཅད་བསོགས་ཏེ།
en: When Māra awoke from this dream, he was so terrified that he gathered all his family members.

source: དཔུང་དང་བཅས་པ་དང་། འཁོར་དང་སྡེ་དཔོན་དང་། སྒོ་བ་དང་དེ་དག་འདུས་པར་རིག་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: When he saw that they had gathered along with his armies, his retinue, his generals, and his gatekeepers, he addressed them with these verses:

source: །བདུད་དེས་རྨི་ལམ་དེ་དག་མཐོང་ནས་ཉམ་ཐག་སྟེ།
en: When Māra saw these omens, he became worried.

source: །སྡེ་དཔོན་བདུད་པོ་སེང་གེ་ཟ་འགྲམ་ཞེས་བྱ་དང་། །བུ་རྣམས་དག་དང་འཁོར་རྣམས་གང་དག་ཡིན་ལ་སྨྲས།
en: He summoned the demon captain Siṃhahanu And his sons and his retinue.

source: །ནག་པོའི་རྩ་ལག་དེ་དག་ཀུན་ལ་ཡོངས་སུ་དྲིས།
en: The evil kinsman then conferred with all of them: “Today I heard these verses sung from the sky:

source: །ཤཱཀྱའི་ནང་དུ་སྐྱེས་པ་མཚན་མཆོག་ཡན་ལག་སྤྲས།
en: ‘A being was born among the Śākyas adorned with perfect marks.

source: །ལོ་དྲུག་བར་དུ་བྱ་དཀའ་བརྟུལ་ཞུགས་དྲག་པོ་སྤྱད། །བྱང་ཆུབ་ཤིང་དྲུང་འོངས་ཀྱིས་རབ་ཏུ་སྒྲིམས་ཤིག་ཅེས། །མདང་སུམ་བར་སྣང་ལས་ནི་ཚིགས་བཅད་དེ་སྐད་གྲག །
en: He practiced severe austerities for six years, and now has arrived at the Bodhi tree.’ You must make great effort!

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་རྣམ་པར་སངས་རྒྱས་ནས།
en: “If the Bodhisattva becomes awakened, all by himself

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་རྣམས་རྟོགས་བྱེད།
en: He will awaken billions of beings.

source: །གང་ཚེ་བདུད་རྩི་ཐོབ་སྟེ་བསིལ་བའི་དངོས་རེག་ཚེ།
en: When he attains immortality and reaches the cool state,

source: །དེས་ནི་ང་གནས་མ་ལུས་སྟོང་པར་བྱེད་པར་འགྱུར།
en: He will empty all our abodes. “Come on!

source: །དཔུང་ཆེན་རྣམས་དང་ལྷན་ཅིག་དེར་ནི་རབ་དོང་ལ།
en: Let us advance with a great army!

source: །ཤིང་དབང་དྲུང་འདུག་དགེ་སྦྱོང་གཅིག་དེ་གཞོམ་པར་བྱ།
en: We shall destroy that monk, alone at the king of trees.

source: །ཡན་ལག་བཞི་པའི་སྡེ་རྣམས་མྱུར་དུ་རབ་ཏུ་སྒྲིམས།
en: Quick, mobilize the four army divisions!

source: །གལ་ཏེ་ང་ལ་སྡུག་སེམས་ཕྱི་ཤོལ་མ་བྱེད་ཅིག །དགྲ་བཅོམ་རང་སངས་རྒྱས་ཀྱིས་འཇིག་རྟེན་གང་གྱུར་ཀྱང་།
en: If you wish to please me, do not delay this. “Although the world may be full of worthy ones and solitary buddhas,

source: །མྱ་ངན་འདའ་བས་བདག་དཔུང་ཉམ་ཆུང་ཡོང་མི་འགྱུར།
en: My force will remain unharmed when they pass beyond suffering.

source: །དེ་ཡང་གཅིག་པུ་རྒྱལ་བ་ཆོས་རྒྱལ་གྱུར་ན་ནི།
en: Yet if he alone becomes a victorious one and a Dharma king,

source: །བགྲང་ལས་འདས་པའི་རྒྱལ་བའི་རིགས་ནི་གཞལ་མི་འཆད།
en: He would never allow the line of uncountable victorious ones to be broken.”

source: །དགེ་སློང་དག་དེ་ནས་བདུད་ཀྱི་བུ་དེད་དཔོན་ཞེས་བྱ་བས་བདུད་སྡིག་ཅན་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Monks, at that point the son of Māra, the evil one, who was named Sārthavāha, addressed his father in these verses:

source: ཡབ་ཅིག་ཅི་ནོངས་ཞལ་གྱུར་ཅིང་ནི་ཞལ་མདོག་ཉམས།
en: “Father, why is your face so sad and pale?

source: །ཐུགས་ཀྱང་འཕར་ལ་ཁྱོད་ཀྱི་ཡན་ལག་ཉིང་ལག་འདར།
en: Your heart is thumping and your every limb is shaking.

source: །ཁྱོད་ཀྱིས་ཅི་གསན་ཅི་གཟིགས་མྱུར་དུ་བཀའ་སྩོལ་ཅིག །ཡང་དག་བསམས་ནས་དེ་བཞིན་སྦྱར་བ་འཚལ་བར་བགྱི།
en: Come now, tell me quick, what did you hear or witness? Let us discover the truth and devise a plan.”

source: །ང་རྒྱལ་མེད་བདུད་སྨྲས་པ་བུ་ཅིག་ང་ལ་ཉོན།
en: With his pride vanished, Māra said: “Son, listen to me.

source: །ངས་ནི་སྡིག་པའི་རྨི་ལམ་ཤིན་ཏུ་མི་བཟད་རྨིས།
en: I had a bad dream, extremely terrifying.

source: །དེ་རིང་འཁོར་འདིར་དེ་ཀུན་མ་ལུས་སྨྲས་ན་ནི།
en: If I were to tell everything now to the audience here,

source: །ཁྱེད་རྣམས་བརྒྱལ་ཏེ་ས་ལ་རབ་ཏུ་སྒྱེལ་བར་འགྱུར།
en: You would faint and fall to the ground.”

source: །དེད་དཔོན་གྱིས་སྨྲས་པ།
en: Sārthavāha said:

source: གལ་ཏེ་འཐབ་དུས་བབ་སྟེ་རྒྱལ་ན་ནོངས་མ་མཆིས།
en: “When the time for battle has arrived, victory is of no bad consequence;

source: །གལ་ཏེ་དེར་ནི་བཅོམ་པར་གྱུར་ན་ནོངས་དང་བཅས།
en: However, for the one who is killed, there is detriment.

source: །གལ་ཏེ་ཁྱོད་ཀྱི་རྨི་ལམ་དེ་འདྲའི་ལྟས་ལགས་ན།
en: If your dream conveys an omen of this kind,

source: །བཞག་ན་དགེ་སྟེ་གཡུལ་ངོར་ཡོངས་སུ་བསྟངས་མི་འགྱུར།
en: It may be best to give up and not go to war, which would bring humiliation.”

source: །བདུད་ཀྱིས་སྨྲས་པ།
en: Māra replied:

source: བརྩལ་བ་གྲུབ་པའི་སྐྱེས་བུ་གཡུལ་ངོར་གྲགས་པར་འགྱུར།
en: “One with a determined mind will win in battle;

source: །གལ་ཏེ་བརྟན་ལ་བརྟེན་ཏེ་ལེགས་བྱས་བདག་ཅག་རྒྱལ།
en: If we rely on firmness and correct action, victory will be ours.

source: །ཁོ་བོ་འཁོར་དང་བཅས་པ་མཐོང་ནས་ལངས་ནས་སུ།
en: When he sees me and my retinue,

source: །ཁོ་བོའི་རྐང་པར་མགོས་ཕྱག་མི་འཚལ་དེས་མི་ནུས།
en: He will be powerless but to rise and bow to my feet.”

source: རྒྱ་ཆེན་དཔུང་བདོག་ཀྱང་ནི་ཤིན་ཏུ་མཐུ་ཆུང་སྟེ། །སྟོབས་ལྡན་དཔའ་བོ་གཅིག་པུ་མཆིས་ན་གཡུལ་ལས་རྒྱལ།
en: “An army may be vast, but if it is weak, A single powerful hero may win the battle.

source: །གལ་ཏེ་སྲིན་བུ་མེ་ཁྱེར་སྟོང་གསུམ་གང་གྱུར་ཀྱང་།
en: Even if the universe were filled with fireflies,

source: །ཉི་མ་གཅིག་པུའི་ཟིལ་དུ་བརླག་སྟེ་འོད་མི་བགྱིད།
en: They could be destroyed and eclipsed by a single sun. “Moreover:

source: །གཞན་ཡང་གང་ལ་ང་རྒྱལ་གཏི་མུག་མཆིས་ལ་དཔྱོད་མ་མཆིས།
en: He who is proud and ignorant does not have much acumen;

source: །མཁས་དང་མི་འཐུན་བགྱིད་པ་དེ་ནི་གསོ་མི་ནུས།
en: If he is opposed to a shrewd person, he will not be able to think effectively.”

source: །དགེ་སློང་དག་དེ་ལྟར་བདུད་སྡིག་ཅན་གྱིས་དེད་དཔོན་གྱི་ཚིག་མཉན་ནས།
en: Monks, Māra, the evil one, did not pay heed to Sārthavāha’s warning.

source: ཡན་ལག་བཞི་པའི་དཔུང་ཆེན་པོ་སྟོབས་ཆེ་བ།
en: Instead, he gathered all four divisions of his great and powerful army.

source: འཐབ་མོ་ལ་དཔའ་བ། འཇིགས་སུ་རུང་བ། སྤུ་ཟིང་ཞེས་བྱེད་ནུས་པ།
en: It was a terrifying army, so brave in battle that it would make anyone’s hair stand on end.

source: ལྷ་དང་མི་རྣམས་ཀྱིས་སྔོན་མ་མཐོང་མ་ཐོས་པ།
en: Such an army had never been seen before, or even heard of, in the realms of gods and humans.

source: བཞིན་བསྒྱུར་བ་རྣམ་པ་མང་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་བསྒྱུར་བའི་རྣམ་པ་དང་ལྡན་པ།
en: The soldiers were able to transform their faces in a trillion ways.

source: རྐང་ལག་སྦྲུལ་བརྒྱ་སྟོང་གིས་དཀྲིས་པ་དང་ལྡན་པ། རལ་གྲི་དང་། མདའ་གཞུ་དང་། མདུང་ཐུང་དང་། མདའ་བོ་ཆེ་དང་། སྟ་རེ་དང་། རྩེ་གསུམ་ཁ་གདེང་དང་། བོང་བ་དང་། གཏུན་ཤིང་དང་། བེ་ཅོན་དང་། ཞགས་པ་དང་། དབྱུག་ཏོ་དང་། འཁོར་ལོ་དང་། རྡོ་རྗེ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་ཐོགས་པ་དང་། ལུས་ལ་གོ་ཆ་བཟང་པོ་བགོས་པ།
en: On their arms and legs slithered hundreds of thousands of snakes, and in their hands they brandished swords, bows, arrows, darts, lances, axes, tridents, clubs, staffs, bludgeons, lassos, cudgels, discuses, vajras, and spears. Their bodies were covered in finest cuirasses and armor.

source: མགོ་དང་། རྐང་ལག་དང་། མིག་ལོག་པར་འདུག་པ།
en: Some had their heads, hands, or feet turned backward, or their eyes facing backward.

source: མགོ་དང་། མིག་དང་། གདོང་འབར་བ།
en: Their heads, eyes, and faces were ablaze.

source: ལྟོ་དང་རྐང་ལག་དབྱིབས་མི་སྡུག་པ། བཞིན་གཟི་བརྗིད་དྲག་པོ་དང་ལྡན་པ། ཤིན་ཏུ་བཞིན་བསྒྱུར་ཅིང་སོ་གཙིགས་པ། འཇིགས་སུ་རུང་བར་མཆེ་བ་གཙིགས་པ། ལྕེ་སྟུག་ཅིང་ཞེང་ཆེ་བ་མང་པོ་འཕྱང་བ།
en: Their bellies, hands, and feet were deformed, and their faces brimmed with vehement ardor. Their mouths, with protruding ugly fangs, appeared contorted in the extreme, and their thick and broad tongues, rough like a turtle’s neck or a straw mat, dangled from their mouths.

source: ལྕེ་འབར་འབུར་ཅན་རེ་ལྡེ་དང་འདྲ་བ། མིག་མེ་དང་སྦྲུལ་ནག་པོ་དུག་གིས་རྒྱས་པའི་མིག་ལྟར་དམར་བ་དག་ཆར་བཅུག་སྟེ།
en: Like the eyes of a black snake, which are flush with poison, their eyes were blazing red, as if on fire.

source: དེ་ལ་ཁ་ཅིག་ནི་སྦྲུལ་གདུག་སྐྱུག་པ། ཁ་ཅིག་ནི་ནམ་མཁའ་ལྡིང་གིས་རྒྱ་མཚོ་ནས་ཕྱུང་བ་བཞིན་དུ་ལག་མཐིལ་དུ་སྦྲུལ་གདུག་པ་བཞག་སྟེ་ཟ།
en: Some of them were vomiting poisonous snakes, while others, like garuḍas emerging from the ocean, grasped these poisonous snakes in their hands and ate them.

source: ཁ་ཅིག་ནི་མིའི་ཤ་དང་། ཁྲག་དང་། རྐང་ལག་དང་། མགོ་དང་། མཁལ་མ་དང་། ནང་གྲོལ་དང་། ངན་སྐྱུགས་ལ་སོགས་པ་ཟ་ཁ་ཅིག་ནི་གཟུགས་སྔོ་བསངས་དང་། ཁམ་པ་པོ་དང་། སྔོན་པོ་དང་། དམར་པོ་དང་། སེར་པོར་འདུག་སྟེ། འཇིགས་སུ་རུང་བའི་གཟུགས་སྣ་ཚོགས་ཅན།
en: Some ate human flesh and drank blood, chewing on human arms, legs, heads, and livers, and slurping entrails, feces, and vomit. Their terrifying bodies had many colors, such as brown, blue, red, black, and blazing yellow.

source: ཁ་ཅིག་ནི་མིག་ཞིགས་པ་དང་། མིག་ཁྲོན་པ་ལྟ་བུ་དང་། མིག་ཕྱུང་བ་ལྟ་བུ་དང་། མིག་འབར་བ་དང་། མིག་བཟུར་བ། མི་སྡུག་པ།
en: Some had ugly hollow eyes, like wells. Others had eyes that were gouged out, eyes that were ablaze, or disfigured eye sockets.

source: ཁ་ཅིག་ནི་མིག་ལོག་པ་དང་། འབར་བ་དང་། མི་སྡུག་པ།
en: Some had ugly eyes, rolling and blazing.

source: ཁ་ཅིག་ནི་རི་འབར་བ་ཐོགས་ཏེ། འགྱིང་ཞིང་རི་གཞན་ལ་ཞོན་ཏེ་འོང་།
en: Some carried flaming mountains in their hands while playfully riding on other mountains as their mount.

source: ཁ་ཅིག་ནི་ཤིང་རྩ་ཐོན་བྱས་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ལོགས་སུ་རྒྱུག་ཅིང་འོང་།
en: Others ran toward the Bodhisattva, carrying trees that had been uprooted.

source: ཁ་ཅིག་གི་རྣ་བ་ནི་ཕག་རྣ་ལྟ་བུ་དང་། ཞིབ་མ་ལྟ་བུ་དང་། གླང་པོའི་རྣ་བ་ལྟ་བུ་དང་། འཕྱང་བ་དང་། ཕག་རྣ་ལྟ་བུར་འདུག་པ།
en: Some had ears like goats, demons, elephants, or pigs, or hanging ears.

source: ཁ་ཅིག་ནི་རྣ་བ་མེད་པ།
en: Others had no ears at all.

source: ཁ་ཅིག་ནི་ཀེང་རུས་མང་པོ་སྤྲུལ་ནས་ལུས་རིད་ཅིང་གསུས་པ་ཆེ་ལ་སྣ་ཞོམ་པ།
en: Some had swollen bellies and weak bodies, with their bones sticking out.

source: གསུས་པ་བུམ་པ་ལྟ་བུར་འདུག་པ། རྐང་པ་མགོའི་ཐོད་པ་ལྟར་འདུག་པ།
en: They had broken noses, bellies like barrels, and feet round as balls.

source: པགས་པ་དང་། ཤ་དང་ཁྲག་སྐམས་པ། རྣ་བ་དང་། སྣ་དང་། རྐང་ལག་དང་། མིག་དང་། མགོ་བཅད་པ།
en: Their skin, flesh, and blood had dried out, and their ears, noses, hands, feet, eyes, or heads were cut.

source: ཁ་ཅིག་ནི་ཁྲག་འཐུང་འདོད་པས་གཅིག་ལ་གཅིག་མགོ་གཅོད་པ།
en: Some were so thirsty for blood that they would cut each other’s heads off.

source: ཁ་ཅིག་ནི་སྒྲ་ཤ་ཤ་པོ་དང་། སྒྲ་མི་སྙན་པ་དང་། འཇིགས་སུ་རུང་བ་དང་། སྒྲ་རྩུབ་པ་དང་ལྡན་པ།
en: They would make snappy, ugly, terrifying, and rough sounds of “Phut phut, picut, phulu phulu!” Others would call, “Let’s get rid of him!

source: ཧུ་ཧུ་ཞེས་བྱ་བ་དང་། མཆི་ཞེས་བྱ་བ་དང་། ཧུ་ལུ་ཧུ་ལུ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་པ་དང་། སྤྱུགས་པ་ལེན་པ་དང་། དགེ་སྦྱོང་གཽ་ཏ་མ་འདི་ཤིང་དང་ཆོས་ཏེ་འོན་ཅིག་ཅེས་ཟེར་བ་དང་། འོར་ཅིག་ཅེས་ཟེར་བ་དང་། རྒྱོབ་ཅིག་ཅེས་ཟེར་བ་དང་། རབ་ཏུ་རྒྱོབ་ཅིག་ཅེས་ཟེར་བ་དང་། ཆིངས་ཤིག་ཅེས་ཟེར་བ་དང་། ཟུང་ཤིག་ཅེས་ཟེར་བ་དང་། ཆོད་ཅིག་ཅེས་ཟེར་བ་དང་། གཏུབས་ཤིག་ཅེས་ཟེར་བ་དང་། གཏོགས་ཤིག་ཅེས་ཟེར་བ་དང་། བབ་བབ་ཏུ་འོར་ཅིག་ཅེས་ཟེར་བ་དག་གོ།
en: Grab that mendicant Gautama along with his tree! Let’s make sure that he is caught, cut, slashed, tied, held, harassed, cut in pieces, gotten rid of, and destroyed!”

source: །ཁ་ཅིག་ནི་ཝ་དང་། ཅེ་སྤྱང་དང་། ཕག་དང་། བོང་བུ་དང་། བ་ལང་དང་། གླང་པོ་ཆེ་དང་། རྟ་དང་། རྔ་མོ་དང་། རྐྱང་དང་། མ་ཧེ་དང་། རི་བོང་དང་། གཡག་དང་། བསེ་དང་། རི་དགས་ལྡང་སྐོ་སྐ་ལ་སོགས་པའི་ཁ་གདོང་སྣ་ཚོགས་འཇིགས་སུ་རུང་བ་སྔངས་པར་བྱེད་པ། མི་སྡུག་པ་དང་ལྡན་པ་དག་གོ།
en: They were disfigured and caused terror with their awful faces of foxes, jackals, pigs, donkeys, oxen, elephants, horses, camels, wild asses, buffaloes, rabbits, yaks, rhinos, and the eight-legged lion beast.

source: །ཁ་ཅིག་ནི་སེང་གེ་དང་། སྟག་དང་། ཕག་རྒོད་དང་། དྲེད་དང་། སྤྲེའུ་དང་། གཟིག་དང་། བྱི་ལ་དང་། ར་དང་། ལུག་དང་། སྦྲུལ་དང་། ནེའུ་ལེ་དང་། ཉ་དང་། ཆུ་སྲིན་དང་། ཆུ་སྲིན་བྱིས་པ་གསོད་དང་། རུས་སྦལ་དང་། བྱ་རོག་དང་། བྱ་རྒོད་དང་། འུག་པ་དང་། ནམ་མཁའ་ལྡིང་ལྟ་བུའི་ལུས་དང་ལྡན་པ་དག་གོ།
en: Some had animal bodies like lions, tigers, wild boars, bears, monkeys, elephants, cats, goats, sheep, snakes, mongooses, fish, crocodiles, alligators, tortoises, ravens, vultures, owls, and garuḍas.

source: །ཁ་ཅིག་ནི་གཟུགས་མི་སྡུག་པ་དག་གོ།
en: Some had misshapen forms.

source: །ཁ་ཅིག་ནི་མགོ་གཅིག་པ་དང་། མགོ་གཉིས་པ་ནས་མགོ་བརྒྱ་སྟོང་གི་བར་དང་ལྡན་པ་དག་གོ།
en: Some had just one head, but others had two or more, some had even up to one hundred thousand.

source: །ཁ་ཅིག་ནི་མགོ་མེད་པའོ།
en: Some had no head at all.

source: །ཁ་ཅིག་ནི་ལག་པ་གཅིག་པ་ནས་ལག་པ་བརྒྱ་སྟོང་གི་བར་དང་ལྡན་པ་དག་གོ།
en: Some had just one arm while others had up to one hundred thousand.

source: །ཁ་ཅིག་ནི་ལག་པ་མེད་པ་དག་གོ།
en: Others had no arms.

source: །ཁ་ཅིག་ནི་རྐང་པ་གཅིག་པ་ནས་རྐང་པ་བརྒྱ་སྟོང་གི་བར་དང་ལྡན་པ་དག་གོ།
en: Some had just one leg while others had up to one hundred thousand.

source: །ཁ་ཅིག་ནི་རྐང་པ་མེད་པ་དག་གོ།
en: Others had no legs at all.

source: །ཁ་ཅིག་ནི་རྣ་བ་དང་། ཁ་དང་། སྣ་དང་། མིག་དང་། ལྟེ་བའི་ཁུང་བུ་ནས་སྦྲུལ་གདུག་པ་འབྱིན་ཏོ།
en: Some had poisonous snakes emerging from their bodily apertures—ears, mouths, noses, eyes, and belly buttons.

source: ཁ་ཅིག་ནི་རལ་གྲི་དང་། མདའ་གཞུ་དང་། མདུང་ཐུང་དང་། རྩེ་གསུམ་ཁ་གདེང་དང་། དགྲ་སྟ་དང་། འཁོར་ལོ་དང་། མདའ་བོ་ཆེ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། རྡོ་རྗེ་དང་། བོང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་ལ་སོགས་པ་མཚོན་ཆ་སྣ་ཚོགས་གསོར་ཞིང་གར་བྱེད་ལ། བྱང་ཆུབ་སེམས་དཔའ་ལ་སྡིགས་མོ་བྱེད་དོ།
en: They threatened the Bodhisattva as they danced around and brandished their many weapons, such as swords, bows, arrows, darts, tridents, axes, discuses, spears, lances, vajras, javelins, and other sharp weapons.
